Repository: liboyang42-cpu/chengyin-ios
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settingsNative.blocked.accountDeletion.message
source: Account cancellation is not connected here. You can read the source notice, but this screen cannot submit or cancel an account-deletion request.
zh_hans: 此处尚未接入账号注销流程。可以阅读源文档，但无法提交或撤销注销申请。

# settingsNative.blocked.accountDeletion.title
source: Account cancellation
zh_hans: 账号注销

# settingsNative.blocked.locationConsent.message
source: Location-consent withdrawal is not connected in this native build. No permission or consent changes can be made on this screen.
zh_hans: 此原生版本尚未接入定位同意撤回流程，无法在此更改权限或同意记录。

# settingsNative.blocked.locationConsent.title
source: Privacy & location
zh_hans: 隐私与定位

# settingsNative.blocked.marketingConsent.message
source: Marketing preferences require current server records for each merchant and channel. They are not connected here; no on/off state or saved consent is assumed.
zh_hans: 营销偏好需要读取各商家、各渠道的服务器记录。此处尚未接入，不推定开关状态或已保存的同意。

# settingsNative.blocked.marketingConsent.title
source: Marketing preferences
zh_hans: 营销偏好

# settingsNative.blocked.unavailable
source: Control not connected
zh_hans: 此控制尚未接入

# settingsNative.fixture.notice
source: Offline settings preview; preferences stay in this test session
zh_hans: 离线设置预览，偏好仅保留在本次测试会话

# settingsNative.legal.cancellation_notice
source: Account cancellation notice
zh_hans: 账号注销须知

# settingsNative.legal.effectiveDate
source: Source effective date
zh_hans: 源文档生效日期

# settingsNative.legal.loadFailed
source: This document could not be loaded
zh_hans: 文档读取失败

# settingsNative.legal.missingMarket
source: The app market could not be determined, so no regional legal document is selected.
zh_hans: 无法确定应用运营市场，暂不选择地区法律文档。

# settingsNative.legal.missingTitle
source: Document not yet provided
zh_hans: 文档待提供

# settingsNative.legal.noAcceptance
source: Reading this page does not record agreement or consent.
zh_hans: 阅读此页不会记录协议接受或同意。

# settingsNative.legal.pendingSourceText
source: The app privacy policy is missing from the source. No substitute text is shown.
zh_hans: 源应用尚未提供 App 隐私政策正文，此处不展示替代文本。

# settingsNative.legal.privacy_policy
source: Privacy policy
zh_hans: 隐私政策

# settingsNative.legal.regionalTextNotProvided
source: Legal documents for the US market have not been provided. Changing the display language does not change your market.
zh_hans: 尚未提供美国市场适用的法律文档。更改界面语言不会更改运营市场。

# settingsNative.legal.sourceNotice
source: Chinese source text from the existing app. Native-app legal review is still required; an approved English version has not been supplied.
zh_hans: 以下为原应用中的中文源文档，仍需完成原生 App 法务审阅；尚未提供经过批准的英文版本。

# settingsNative.legal.title
source: Legal documents
zh_hans: 法律文档

# settingsNative.legal.user_agreement
source: User service agreement
zh_hans: 用户服务协议

# settingsNative.legal.version
source: Source version
zh_hans: 源文档版本

# settingsNative.loading
source: Loading…
zh_hans: 正在读取…

# settingsNative.privacy.title
source: Privacy and account controls
zh_hans: 隐私与账号控制

# settingsNative.retry
source: Retry
zh_hans: 重试

# settingsNative.sound.airplane
source: Airplane ambience
zh_hans: 飞机环境音

# settingsNative.sound.ambient
source: Ambient sounds
zh_hans: 环境音

# settingsNative.sound.forest
source: Forest
zh_hans: 森林

# settingsNative.sound.haptics
source: Haptics
zh_hans: 触感

# settingsNative.sound.loadFailed
source: Sound preferences could not be loaded. Existing stored data has not been replaced.
zh_hans: 声音偏好读取失败，原有数据未被覆盖。

# settingsNative.sound.localOnly
source: These preferences are saved on this device. Playback and haptic feedback are not connected to them in this build. Airplane ambience does not change Airplane Mode.
zh_hans: 这些偏好仅保存在本机。本版本的音频播放和触感反馈尚未接入这些偏好。飞机环境音不会更改系统飞行模式。

# settingsNative.sound.ocean
source: Ocean
zh_hans: 海洋

# settingsNative.sound.raindrop
source: Raindrops
zh_hans: 雨滴

# settingsNative.sound.saveFailed
source: The change could not be saved. Your previous preference is still shown.
zh_hans: 更改未能保存，仍显示之前的偏好。

# settingsNative.sound.sound
source: Sound
zh_hans: 声音

# settingsNative.sound.title
source: Sound & haptics
zh_hans: 声音与触感

# shopNPC.assistant
source: Shop AI
zh_hans: 店铺 AI

# shopNPC.busy
source: Waiting for a reply…
zh_hans: 正在回答…

# shopNPC.cancel
source: Cancel
zh_hans: 取消

# shopNPC.confirmSend
source: Confirm and send
zh_hans: 确认发送

# shopNPC.conversation
source: Conversation
zh_hans: 对话

# shopNPC.disabled
source: Shop conversation is not enabled.
zh_hans: 店铺分身对话还没开放

# shopNPC.discard
source: Discard recording
zh_hans: 丢弃录音

# shopNPC.disclosure
source: AI replies may be inaccurate and do not complete game tasks.
zh_hans: AI 回答可能不准确，且不会完成游戏任务

# shopNPC.invalid
source: Review your question or recording again.
zh_hans: 请重新检查问题或录音

# shopNPC.malformed
source: No usable answer was returned.
zh_hans: 未收到有效回答

# shopNPC.open
source: Talk to this shop
zh_hans: 与店铺分身对话

# shopNPC.question
source: Question
zh_hans: 问题

# shopNPC.rateLimited
source: Please wait before trying again.
zh_hans: 请稍候再试

# shopNPC.record
source: Start recording
zh_hans: 开始录音

# shopNPC.regenerate
source: Review a new answer request
zh_hans: 重新回答前检查

# shopNPC.review
source: Review before sending
zh_hans: 发送前检查

# shopNPC.reviewText
source: Review question
zh_hans: 检查问题

# shopNPC.server
source: The service could not answer.
zh_hans: 服务暂时无法回答

# shopNPC.stale
source: This session changed. Reopen the conversation.
zh_hans: 会话已变更，请重新打开对话

# shopNPC.stopReview
source: Stop and review recording
zh_hans: 停止并检查录音

# shopNPC.title
source: Shop conversation
zh_hans: 店铺分身对话

# shopNPC.transmissionDisclosure
source: Confirm to send this question or voice to the configured shop AI service. Voice can incur transcription and AI processing costs.
zh_hans: 确认后将问题或语音发送至配置的店铺 AI 服务，语音可能产生转写及 AI 处理费用

# shopNPC.unknownOutcome
source: Delivery is uncertain. Confirm retry to resend the same request ID.
zh_hans: 发送结果未知，确认重试将沿用同一请求编号

# shopNPC.voiceDisclosure
source: Recording requires microphone permission. Stopping only prepares a review; nothing is sent automatically.
zh_hans: 录音需要麦克风权限，停止仅准备审核，不会自动发送

# shopNPC.voiceReview
source: Recorded voice will be sent for transcription and an AI reply.
zh_hans: 录音将发送用于语音识别及 AI 回复

# shopNPC.you
source: You
zh_hans: 你

# social.about
source: About
zh_hans: 关于

# social.achievements
source: Achievements
zh_hans: 成就

# social.acknowledged
source: The server acknowledged the request. Refresh the original page for the current state.
zh_hans: 服务端已确认请求，请刷新原页面查看最新状态。

# social.actionEnabled
source: Enable this action
zh_hans: 开启此操作

# social.actions
source: Actions
zh_hans: 操作

# social.changed
source: The account or content changed. Open a new review.
zh_hans: 账号或内容已变化，请重新预览。

# social.commentsClosed
source: Comments are unavailable for this post.
zh_hans: 此动态暂不可评论。

# social.currentAccount
source: Current account ID
zh_hans: 当前账号编号

# social.editPreservesMedia
source: Editing text keeps the existing images and linked activity or route.
zh_hans: 编辑文字会保留已有图片和关联活动或路线。

# social.editor.bookmark
source: Bookmark
zh_hans: 收藏动态

# social.editor.comment
source: Write a comment
zh_hans: 写评论

# social.editor.commentLike
source: Toggle comment like
zh_hans: 切换评论点赞

# social.editor.createPost
source: Write a post
zh_hans: 写动态

# social.editor.discard
source: Discard draft
zh_hans: 放弃草稿

# social.editor.discardMessage
source: Your unsaved text will be removed from this screen.
zh_hans: 此页面尚未保存的文字会被清除。

# social.editor.discardTitle
source: Discard this draft?
zh_hans: 要放弃这份草稿吗？

# social.editor.editPost
source: Edit post text
zh_hans: 编辑动态文字

# social.editor.keepEditing
source: Keep editing
zh_hans: 继续编辑

# social.editor.like
source: Post like
zh_hans: 动态点赞

# social.editor.report
source: Report content
zh_hans: 举报内容

# social.editor.startChat
source: Start a conversation
zh_hans: 发起会话

# social.editor.toggleFollow
source: Follow relationship
zh_hans: 关注关系

# social.emptyText
source: Enter some text before reviewing.
zh_hans: 请先输入内容再预览。

# social.explicitActionHint
source: This is the requested state, not a claim about the current saved state.
zh_hans: 此处是希望设置的状态，不代表服务端当前状态。

# social.failed
source: Unable to load this information. Try again.
zh_hans: 暂时无法获取信息，请重试。

# social.fixtureSwitchAccount
source: Switch example account
zh_hans: 切换示例账号

# social.followStatus
source: Relationship
zh_hans: 关注关系

# social.followToggleHint
source: Toggle the current follow relationship once. The server must confirm the resulting relationship; an uncertain result stays locked.
zh_hans: 切换一次当前关注关系。结果必须由服务端确认，未确认时保留锁定。

# social.followers
source: Followers
zh_hans: 粉丝

# social.following
source: Following
zh_hans: 已关注

# social.followingCount
source: Following
zh_hans: 关注人数

# social.guide.classic
source: City orienteering
zh_hans: 城市定向

# social.guide.classicDetail
source: Follow checkpoints in order with your group. Good for planned meetups and story-based routes.
zh_hans: 和队友按顺序打卡通关，适合约人同行和有剧情的路线。

# social.guide.empty
source: Published guides will appear here.
zh_hans: 玩法说明上线后会显示在这里。

# social.guide.explore
source: Explore
zh_hans: 去探索

# social.guide.free
source: Free exploration
zh_hans: 自由探索

# social.guide.freeDetail
source: Explore open checkpoints in your own order and at your own pace.
zh_hans: 点位全部开放，按自己的顺序和节奏探索。

# social.guide.information
source: More information
zh_hans: 更多说明

# social.guide.modes
source: Ways to explore
zh_hans: 探索方式

# social.guide.noContent
source: This guide does not have readable content yet.
zh_hans: 这篇说明暂时没有正文。

# social.guide.removed
source: This guide is no longer available. Go back to the guide list.
zh_hans: 这篇说明已不可用，请返回玩法列表。

# social.guide.roam
source: Roaming
zh_hans: 漫游

# social.guide.roamDetail
source: Walk and discover the city with no required finish line.
zh_hans: 边走边探索城市，不必追赶终点。

# social.guide.title
source: Play guide
zh_hans: 玩法指南

# social.incompleteLink
source: This link is incomplete. Go back to choose another item.
zh_hans: 链接不完整，请返回选择其他内容。

# social.interests
source: Interests
zh_hans: 兴趣

# social.introduction
source: Introduction
zh_hans: 个人介绍

# social.invites.continuationInvalid
source: The next page repeated existing records. Refresh to try again.
zh_hans: 下一页重复了已有记录，请刷新后重试。

# social.invites.earned
source: First-purchase reward received
zh_hans: 首购奖励已到账

# social.invites.empty
source: Your invited members will appear here after they join.
zh_hans: 受邀用户加入后会显示在这里。

# social.invites.loaded
source: Loaded records
zh_hans: 已加载记录

# social.invites.otherMonth
source: Other invitations
zh_hans: 其他邀请

# social.invites.partial
source: Invitation records are available, but rewards are not fully synchronized. Missing rewards do not establish that a first purchase is pending.
zh_hans: 邀请记录已获取，奖励流水尚未完整同步。未查到奖励不代表首购尚未完成。

# social.invites.pending
source: Joined · first purchase pending
zh_hans: 已加入 · 首购待完成

# social.invites.points
source: Reward points
zh_hans: 奖励积分

# social.invites.synchronizing
source: Joined · reward not synchronized
zh_hans: 已加入 · 奖励待同步

# social.invites.timeUnknown
source: Invitation time not recorded
zh_hans: 邀请时间暂未记录

# social.invites.title
source: Invitation history
zh_hans: 邀请记录

# social.invites.total
source: Total invited
zh_hans: 累计邀请

# social.level
source: Level
zh_hans: 等级

# social.likes
source: Likes received
zh_hans: 获赞

# social.loading
source: Loading…
zh_hans: 正在加载…

# social.media.disabled
source: Live image loading awaits approved media origins and size-limited downloads.
zh_hans: 线上图片加载需先确认媒体来源并验证下载大小限制。

# social.media.failed
source: The image could not be loaded or decoded safely.
zh_hans: 图片无法加载或安全解码。

# social.media.image
source: Message image
zh_hans: 消息图片

# social.media.invalid
source: This message does not contain a supported secure image address.
zh_hans: 这条消息不包含支持的安全图片地址。

# social.media.load
source: Load image
zh_hans: 加载图片

# social.media.purpose
source: Loading connects to the media host below without account credentials. No upload is performed.
zh_hans: 加载时会连接下方媒体站点，不发送账号凭据，也不会上传内容。

# social.media.title
source: Image preview
zh_hans: 图片预览

# social.moderationHint
source: An acknowledgement does not prove that content is published or visible. The server remains authoritative.
zh_hans: 请求已确认不等于内容已发布或可见，最终结果以服务端为准。

# social.noInterests
source: No interests provided.
zh_hans: 暂无兴趣标签。

# social.noIntroduction
source: No introduction provided.
zh_hans: 暂无个人介绍。

# social.noPosts
source: No posts yet.
zh_hans: 暂无动态。

# social.notConfigured
source: This service is not configured.
zh_hans: 此服务尚未配置。

# social.notFollowing
source: Not following
zh_hans: 未关注

# social.notSent
source: Nothing was sent. Start a new review when ready.
zh_hans: 未发送任何内容，可重新预览。

# social.offline
source: Offline example. All people, records and outcomes here are synthetic.
zh_hans: 离线示例。人物、记录和结果均为虚构测试数据。

# social.ownerRequired
source: Only the post owner can edit this post.
zh_hans: 只有作者可以编辑这篇动态。

# social.portfolio
source: Exploration portfolio
zh_hans: 探索作品

# social.posts
source: Posts
zh_hans: 动态

# social.postsSignIn
source: Sign in to load this member’s posts.
zh_hans: 登录后查看该用户的动态。

# social.profile
source: Public profile
zh_hans: 公开主页

# social.profileActionsDisabled
source: Follow and conversation actions can be reviewed. Live actions remain unavailable.
zh_hans: 可预览关注和发起会话操作，线上操作暂未开放。

# social.profileSection
source: Profile section
zh_hans: 主页内容

# social.published
source: Published routes and activities
zh_hans: 已发布路线和活动

# social.rejected
source: The request was rejected. Review the content before trying again.
zh_hans: 请求被拒绝，请检查内容后再操作。

# social.relationshipUnknown
source: Sign in to see your relationship
zh_hans: 登录后查看关注关系

# social.reply
source: Reply
zh_hans: 回复

# social.reportHint
source: Send this item to the review queue. The source endpoint accepts the item ID only, with no reason or evidence fields.
zh_hans: 将此内容提交审核队列。源接口只接受内容编号，不接受理由或证据字段。

# social.review
source: Review
zh_hans: 预览

# social.reviewTarget
source: Review target
zh_hans: 确认操作对象

# social.signIn
source: Sign in to continue.
zh_hans: 请登录后继续。

# social.simulate
source: Simulate this example
zh_hans: 模拟示例操作

# social.simulated
source: Synthetic acknowledgement only. Nothing was sent externally.
zh_hans: 仅为模拟确认，未向外部发送任何内容。

# social.startChatHint
source: Request a conversation with this member. Navigation requires a positive conversation ID from the server.
zh_hans: 请求与该用户建立会话，只有服务端返回有效会话编号后才能打开聊天。

# social.submit
source: Submit
zh_hans: 提交

# social.targetComment
source: Comment ID
zh_hans: 评论编号

# social.targetMember
source: Member ID
zh_hans: 用户编号

# social.targetPost
source: Post ID
zh_hans: 动态编号

# social.text
source: Text
zh_hans: 正文

# social.toggleHint
source: The source action toggles the existing comment like. An uncertain result must not be retried automatically.
zh_hans: 此操作会切换评论点赞状态。结果未确认时不能自动重试。

# social.unknown
source: The outcome is unknown. This action is locked to avoid duplicates. Returning or signing in again will not retry it.
zh_hans: 操作结果未确认，已锁定以防重复。返回页面或重新登录不会重试。

# social.viewAuthor
source: View author profile
zh_hans: 查看作者主页

# social.willDisable
source: Requested state: disabled
zh_hans: 期望状态：关闭

# social.willEnable
source: Requested state: enabled
zh_hans: 期望状态：开启

# social.writesDisabled
source: Review only. Live posting, replies, reactions, reports, follows and conversation creation are disabled.
zh_hans: 仅供预览。线上发帖、回复、互动、举报、关注和创建会话均未开放。

# square.applyFilter
source: Apply filter
zh_hans: 应用筛选

# square.cityCode
source: City code
zh_hans: 城市代码

# square.cityPurpose
source: Enter a city code to request its public feed. Your precise location is not requested
zh_hans: 输入城市代码以读取该城市的公开动态，此处不请求精确位置

# square.cityRequired
source: Enter a city code to view nearby posts
zh_hans: 输入城市代码后查看附近动态

# square.club
source: Club
zh_hans: 俱乐部

# square.comments
source: Comments
zh_hans: 评论

# square.commentsLoading
source: Loading comments…
zh_hans: 正在读取评论…

# square.communityID
source: Community ID
zh_hans: 社群编号

# square.communityRequired
source: Enter a valid community ID
zh_hans: 请输入有效的社群编号

# square.completed
source: Completed
zh_hans: 已完成

# square.detail
source: Post details
zh_hans: 动态详情

# square.disclosure
source: Disclosure
zh_hans: 披露信息

# square.empty
source: No posts found
zh_hans: 暂无动态

# square.failed
source: This content could not be loaded
zh_hans: 暂时无法读取内容

# square.feed
source: Feed
zh_hans: 动态来源

# square.gov.account
source: Account
zh_hans: 账号

# square.gov.acknowledged
source: Request acknowledged. Refresh to verify status; this is not proof of an approved appeal or deleted comment.
zh_hans: 请求已受理。请刷新核实状态；这不代表申诉成功或评论已删除。

# square.gov.appeal
source: Request review
zh_hans: 申请复核

# square.gov.appealFacts
source: Explain the facts you would like reviewed. No evidence upload is supported by this source flow.
zh_hans: 说明需要复核的事实。此来源流程不支持上传申诉证据。

# square.gov.approveComment
source: Approve pending comment
zh_hans: 批准待审评论

# square.gov.cancel
source: Cancel
zh_hans: 取消

# square.gov.commentRoles
source: Post authors can approve pending comments. Only comment authors can delete their own comments. Moderator status alone does not grant these actions.
zh_hans: 帖文作者可批准待审评论；只有评论作者可删除自己的评论。管理员身份本身不授予这些操作权限。

# square.gov.comments
source: Comment controls
zh_hans: 评论管理

# square.gov.confirm
source: Confirm reviewed request
zh_hans: 确认已核对的请求

# square.gov.deleteComment
source: Delete my comment
zh_hans: 删除我的评论

# square.gov.deleteWarning
source: This targets only your comment. Review before requesting deletion.
zh_hans: 此操作仅针对你的评论。请求删除前请核对。

# square.gov.disabled
source: Disabled
zh_hans: 关闭

# square.gov.drafts
source: My drafts and pending content
zh_hans: 我的草稿与待复审内容

# square.gov.emptyEnforcements
source: No enforcement records
zh_hans: 没有社区处置记录

# square.gov.emptyNotifications
source: No notifications
zh_hans: 暂无社区通知

# square.gov.enabled
source: Enabled
zh_hans: 开启

# square.gov.enforcements
source: Enforcements and appeals
zh_hans: 处置与申诉

# square.gov.error
source: Unable to complete. Refresh to retry reading; nothing is assumed successful.
zh_hans: 未能完成。可刷新重试读取；不假定操作成功。

# square.gov.forbidden
source: This account does not have the required permission.
zh_hans: 此账号没有所需权限。

# square.gov.governanceAlways
source: Safety, enforcement and appeal results always arrive
zh_hans: 安全、处置与申诉结果始终送达

# square.gov.interactionEnabled
source: Interactions and replies
zh_hans: 互动与回复

# square.gov.liveDisabled
source: This operation is disabled. A separately reviewed transport grant is required.
zh_hans: 此操作已关闭，需另行核准对应传输权限。

# square.gov.markRead
source: Mark as read
zh_hans: 标为已读

# square.gov.mentionEnabled
source: Mentions
zh_hans: 提及我

# square.gov.moreEnforcements
source: Load more records
zh_hans: 加载更多处置记录

# square.gov.moreNotifications
source: Load more notifications
zh_hans: 加载更多通知

# square.gov.notice.APPEAL_REVERSED
source: Enforcement reversed after appeal
zh_hans: 申诉成功，处置已撤销

# square.gov.notice.APPEAL_SUBMITTED
source: Appeal submitted
zh_hans: 申诉已提交

# square.gov.notice.APPEAL_UPHELD
source: Appeal review completed
zh_hans: 申诉复核已完成

# square.gov.notice.APPROVED
source: Your post was approved
zh_hans: 你的帖文已通过审核

# square.gov.notice.BOOKMARK
source: Someone bookmarked your post
zh_hans: 有人收藏了你的帖文

# square.gov.notice.COMMENT
source: Someone replied to your post
zh_hans: 有人回复了你的帖文

# square.gov.notice.COMMENT_LIKE
source: Someone liked your comment
zh_hans: 有人喜欢了你的评论

# square.gov.notice.FEATURED
source: Your post was featured
zh_hans: 你的帖文已被收录到精选

# square.gov.notice.FOLLOW
source: Someone followed you
zh_hans: 有人关注了你

# square.gov.notice.GUIDELINE_UPDATED
source: Community guidelines updated
zh_hans: 社区规范已更新

# square.gov.notice.LIKE
source: Someone liked your post
zh_hans: 有人喜欢了你的帖文

# square.gov.notice.POST_MENTION
source: You were mentioned in a post
zh_hans: 有人在帖文中提及你

# square.gov.notice.REMOVED
source: Your post did not pass review
zh_hans: 你的帖文未通过审核

# square.gov.notice.REPLY
source: Someone replied to your comment
zh_hans: 有人回复了你的评论

# square.gov.notice.REPORT_RECEIVED
source: Your report was received
zh_hans: 你的举报已受理

# square.gov.notice.REPORT_STAGE
source: Your report progress changed
zh_hans: 你的举报进度已更新

# square.gov.notice.UNKNOWN
source: Community update
zh_hans: 社区动态

# square.gov.notifications
source: Community notifications
zh_hans: 社区通知

# square.gov.openPost
source: Open post
zh_hans: 查看帖文

# square.gov.preferences
source: Notification preferences
zh_hans: 通知偏好

# square.gov.read
source: Read
zh_hans: 已读

# square.gov.reason
source: Facts for review
zh_hans: 需要复核的事实

# square.gov.refresh
source: Refresh
zh_hans: 刷新

# square.gov.review
source: Review request
zh_hans: 核对请求

# square.gov.reviewWarning
source: Review the account, target and exact change. Confirmation checks fresh server facts again. Acknowledgement does not establish the final moderation outcome.
zh_hans: 请核对账号、对象和具体更改。确认前将重新检查服务端事实。请求受理不代表最终处置结果。

# square.gov.signIn
source: Sign in to view account governance
zh_hans: 登录后查看账号社区治理

# square.gov.socialEnabled
source: Social updates
zh_hans: 社交动态

# square.gov.stale
source: Facts changed or review expired. Refresh and review again.
zh_hans: 事实已变化或核对已过期。请刷新后重新核对。

# square.gov.synthetic
source: Synthetic fixture • no network or real moderation
zh_hans: 合成测试 · 不联网、不执行真实处置

# square.gov.title
source: Community governance
zh_hans: 社区治理

# square.gov.unknownLocked
source: Unavailable: permission or state is unknown
zh_hans: 不可操作：权限或状态尚不明确

# square.gov.unknownOutcome
source: This request is locked against repetition. Its outcome must be independently verified.
zh_hans: 此请求已锁定，不能重复提交。需独立核实结果。

# square.gov.unread
source: Unread
zh_hans: 未读

# square.gov.version
source: Expected version
zh_hans: 预期版本

# square.imageLoading
source: Loading image…
zh_hans: 正在读取图片…

# square.imageUnavailable
source: Image unavailable
zh_hans: 图片不可用

# square.invalidCursor
source: These posts are loaded, but the server did not provide a usable next page. Pull to refresh
zh_hans: 已读取当前动态，但服务器未提供有效的下一页信息，请下拉刷新

# square.level
source: Member level
zh_hans: 会员等级

# square.likes
source: Likes
zh_hans: 点赞数

# square.loadMore
source: Load more posts
zh_hans: 加载更多动态

# square.loading
source: Loading posts…
zh_hans: 正在读取动态…

# square.mode.community
source: Community
zh_hans: 社群

# square.mode.featured
source: Featured
zh_hans: 精选

# square.mode.following
source: Following
zh_hans: 关注

# square.mode.forYou
source: For you
zh_hans: 推荐

# square.mode.latest
source: Latest
zh_hans: 最新

# square.mode.nearby
source: Nearby
zh_hans: 附近

# square.mode.topic
source: Topic
zh_hans: 话题

# square.mode.trending
source: Trending
zh_hans: 热门

# square.moreComments
source: Load more comments
zh_hans: 加载更多评论

# square.noComments
source: No comments yet
zh_hans: 暂无评论

# square.notConfigured
source: Square service is not configured
zh_hans: 广场服务尚未配置

# square.offlineExample
source: Offline synthetic example. No live backend is used
zh_hans: 离线合成示例，未连接真实后端

# square.postImage
source: Post image
zh_hans: 动态图片

# square.readOnly
source: Browsing only. Publishing, reactions, sharing and comment actions are not available in this native module yet
zh_hans: 当前仅支持浏览，此原生模块暂未开放发布、互动、分享和评论操作

# square.reference
source: Related content
zh_hans: 关联内容

# square.replyTo
source: Replying to
zh_hans: 回复

# square.retry
source: Retry
zh_hans: 重试

# square.routeProgress
source: Route progress
zh_hans: 路线进度

# square.safety.accessibility
source: Accessibility limitation
zh_hans: 无障碍限制

# square.safety.closure
source: Temporary closure
zh_hans: 临时关闭

# square.safety.dangerous
source: Dangerous activity
zh_hans: 危险活动

# square.safety.flashing
source: Flashing images
zh_hans: 闪烁画面

# square.safety.sensitive
source: Sensitive content
zh_hans: 敏感内容

# square.safety.spoiler
source: Spoiler
zh_hans: 剧透

# square.safety.weather
source: Weather risk
zh_hans: 天气风险

# square.search
source: Search posts
zh_hans: 搜索动态
